"""
Реализовать генератор с помощью функции с ключевым словом yield, создающим очередное значение. При вызове функции должен создаваться объект-генератор. Функция вызывается следующим образом: for el in fact(n).
Она отвечает за получение факториала числа. В цикле нужно выводить только первые n чисел, начиная с 1! и до n!.
Подсказка: факториал числа n — произведение чисел от 1 до n. Например, факториал четырёх 4! = 1 * 2 * 3 * 4 = 24.
"""


def fact(n):
    a = 1
    for i in range(1, n):
        a *= i
        yield a


# Параметр n - верхняя граница чисел
n = 10

print(f'Список факториалов всех чисел от 1 до {n}')
for el in fact(n):
    print(el)
